# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\micha_000\Documents\GitHub\CypressBLEBadge\RGB_OLED\RGB_LCD.cydsn\RGB_LCD.cyprj
# Date: Fri, 29 Dec 2017 16:47:24 GMT
#set_units -time ns
create_clock -name {SPI_Master_SCBCLK(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {CyRouted1} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFClk} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {SPI_Master_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]


# Component constraints for C:\Users\micha_000\Documents\GitHub\CypressBLEBadge\RGB_OLED\RGB_LCD.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\micha_000\Documents\GitHub\CypressBLEBadge\RGB_OLED\RGB_LCD.cydsn\RGB_LCD.cyprj
# Date: Fri, 29 Dec 2017 16:47:16 GMT
